[
    {
        "title": "OneRagtime, Barcelona, Spain",
        "duration": "Apr 2023 - Present",
        "position": "Full-Stack Developer",
        "description": "Maintenance and addition of features to OneRagtime's online venture capital platform for managing investments from investors and performing fundraisings for startup entrepreneurs",
        "technologies": ["Django", "VueJS", "JavaScript", "Python", "Docker", "MySQL"]
    },
    {
        "title": "Harbour.Space, Barcelona, Spain",
        "duration": "Jan 2023 - Apr 2023",
        "position": "Front-End Developer",
        "description": "Maintenance and addition of features to the Student.Space Web Platform",
        "technologies": ["NextJS", "React", "TypeScript", "CSS"]
    },
    {
        "title": "University of Benin, Nigeria",
        "duration": "Jun 2019 - Jun 2022",
        "position": "Technical Lead & Back-End Developer",
        "description": "Student management system for handling student records including class report generation, GPA calculation, result generation, class summaries, course registrations, result entry, progression of students to higher levels when applicable. Allows for multiple simultaneous users, fine-grained access permissions. Running on a locally-hosted Pi server.",
        "technologies": ["Python", "Flask", "SQL", "Linux"]
    },
    {
        "title": "Bank of America, Dublin, Ireland",
        "duration": "Jul 2019 - Dec 2019",
        "position": "FICC Rates Technology Intern",
        "description": "Worked on a central display for viewing/analyzing/filtering trades made with different internal booking systems (legacy and otherwise) which aggregates trades from several sources and presents them to a user either in summary or in detail.\nWas part of a bank-wide migration effort in readiness for Python2 EOL. Was required to understand code and its far-reaching effects in the entire codebase, port deprecated functionality to be supported in line with guidelines following best practice.",
        "technologies": ["Python", "React", "TypeScript", "Redux"]
    }
]
